# 실행권한과 소유 ugo / chmod

<aside>
💡 author : 노주형(jhnho1) 2023-10-15

</aside>

linux에는 한 서버에 많은 인원이 들어갈 수 있습니다. 

이는 때론 매우 유용하지만, 때론 큰 문제를 일으킬 수도 생길 수도 있습니다.

한 사람이 다른 사람의 파일을 임의로 바꾸거나 삭제할 수 있다는 것이죠.

이를 해결하기 위해 linux에는 실행권한이라는 것이 주어집니다. 

이를 통해 본인, 그룹, 모든 유저로 나누어 read, write, delete 할 권한을 따로 부여할 수 있습니다.

- read : 파일을 읽는 것을 말합니다. 이 권한이 있으면 파일을 읽을 수 있습니다.
- write : 파일을 쓰는 것을 말합니다. 원래있던 파일을 편집하거나, 새로운 파일을 생성하는 것을 말합니다.
- delete : 존재하는 파일을 삭제하는 것을 말합니다.

먼저 한 파일의 실행권한을 확인해보도록 합시다.

```bash
ls -la
```

![Untitled](Untitled%20157.png)

여기서 실행권한을 의미하는 것은 맨 왼쪽, 10개의 문자 부분입니다.

이를 차례대로 보도록 하죠

![Untitled](Untitled%20158.png)

먼저 첫 글자 d 입니다.

이는 파일의 종류를 의미합니다.

이후부터는 3글자씩 나누어서 보도록 합시다.

차례대로 user, group, others 를 의미합니다.

| user | u | 소유 유저 |
| --- | --- | --- |
| group | g | 그룹  |
| others | o | 모든 유저 |

더욱 세분화하여 rwx의 각각의 의미를 보도록 하겠습니다.

|  read | r |
| --- | --- |
| write | w |
| execute | x |

의 권한을 의미하며 -의 경우 그 권한이 없다는 의미입니다.

# chmod 와 sudo

chmod 로 파일을 변경하는 것은 시스템에서 아주 중요한 역할을 수행합니다.

누군가가 악성코드나 시스템을 지우는 파일을 저장하고 실행권한을 부여할 수 있으면 해당파일을 실행할 수 있게 되어서 아주 위험합니다.

**따라서 리눅스에서는 chmod 명령어는 root 권한으로만 실행 가능합니다.**

따라서 root 로 로그인된 상태에서 사용하거나, sudo 를 설치해서 root 권한으로 수행해야합니다.

## chmod

이제 이 권한을 바꿔보도록 하겠습니다.

먼저  r,w,x간의 binary number 값을 보겠습니다.

|  read | r | 4 |
| --- | --- | --- |
| write | w | 2 |
| execute | x | 1 |

여기서 허용하고 싶은 권한에 대해서는 그 수를 더하고 아닌 경우 그대로 놔두면 됩니다.

예를 들어 모든 user,group, others가 read only로 만들고 싶은 경우 4 인 것이죠

```bash
chmod 444 [filename]
```

이는 문자를 통해서도 변경할 수 있습니다. 

이 경우 user가 r,w,x의 권한을 가지도록 해보죠

```bash
chmod u+rwx [filename]
```

이 경우 -는 권한을 없애는 것이고,  +는 권한을 부여하는 것입니다.

계속